import pandas as pd

#======================1

scores = {'국어': [88, 90, 84, 92, 75],
          '수학': [70, 68, 80, 76, 84],
          '영어': [80, 80, 85, 91, 79]}

names = ['홍길동', '이영희', '김철수', '김동희', '정수영']

df = pd.DataFrame(scores, index=names)
print(df)

print("=========================================")

print(df['영어'])

print("=========================================")

print(df.loc[df.수학 >= 80])

print("=========================================")

print(df.loc[df.수학 >= 80].loc[df.국어 >=80])

print("=========================================")

df['평균'] = df.sum(axis=1)/len(df.columns)

print(df)

#========================2


data = {
    '도시': ['서울', '서울', '서울', '부산', '부산', '부산', '인천', '인천'],
    '연도': ['2015', '2010', '2005', '2015', '2010', '2005', '2015', '2010'],
    '인구': [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 289041, 263203],
    '지역': ['수도권', '수도권', '수도권', '경상권', '경상권', '경상권', '수도권', '수도권']
}

df1 = pd.DataFrame(data)
print(df1)

print(df1.groupby('도시').groups)

print(df1.groupby('도시').sum()['인구'])

print(df1.groupby('지역').sum()['인구'])

print(df1.groupby('연도').sum()['인구'])

print(df1.groupby('도시').count())

print(df1.groupby('지역').size())
